FILES/Catalogs/ОтчетыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ОтчетыКлиента</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыОтчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИПечатныеФормы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтчетаПользовательский</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фильтры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФильтрыСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбработчикПослеФормирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПреобразованиеИмен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛевоеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИмени</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЭкспорта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантВыбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеВарианта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторИмени</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОтчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FILES/Catalogs/ОтчетыКлиента/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтчетыНастройкиОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТД = Элементы.Отчеты.ТекущиеДанные;
	
	ПараметрыНастроек = Новый Структура();
	ПараметрыНастроек.Вставить("ИдентификаторОтчета", ТД.ИдентификаторОтчета); 
	ПараметрыНастроек.Вставить("СсылкаНаДопОтчеты", ТД.Отчет); 
	ПараметрыНастроек.Вставить("ВариантОтчета", ТД.ВариантОтчета); 
	ПараметрыНастроек.Вставить("Настройки", ТД.Настройки );
	ПараметрыНастроек.Вставить("Фильтры", 	ТД.Фильтры );
	ОткрытьФорму("Справочник.ОтчетыКлиента.Форма.НастройкиОтчета", ПараметрыНастроек, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьВариантыОтчетов(СсылкаНаОтчет)
	ВОбработка = ДополнительныеОтчетыИПечатныеФормыВызовСервер.ВернутьОбработкуПоСсылке(СсылкаНаОтчет);
	
	Выбран = Истина;
	СтруктураВариантов = Новый Структура;
	Для Каждого ВариантНастройки ИЗ ВОбработка.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		СтруктураВариантов.Вставить(ВариантНастройки.Имя, Новый Структура("Выбран, Представление", Выбран, ВариантНастройки.Представление));
		Выбран = Ложь;
	КонецЦикла;
	
	Возврат СтруктураВариантов;
КонецФункции

&НаКлиенте
Процедура ОтчетыВариантОтчетаПриИзменении(Элемент)
	ТД = Элементы.Отчеты.ТекущиеДанные;
	ТД.ПредставлениеОтчета = Строка(ТД.Отчет);
	
	Если ЗначениеЗаполнено(ТД.Отчет) Тогда
		СтруктураВариантов = ПолучитьВариантыОтчетов(ТД.Отчет);
		
		ТД.ВариантОтчета = УправлениеБТВызовСервера.ВJSON(СтруктураВариантов);
		
		Элементы.ОтчетыВариантОтчетаПользовательский.СписокВыбора.Очистить();
		
		Индекс = -1;
		Для Каждого ВариантИзСписка ИЗ СтруктураВариантов Цикл
			Индекс = Индекс+1;
			Элементы.ОтчетыВариантОтчетаПользовательский.СписокВыбора.Вставить(Индекс, ВариантИзСписка.Ключ, ВариантИзСписка.Значение.Представление);
			Если ВариантИзСписка.Значение.Выбран Тогда
				ТД.ВариантОтчетаПользовательский = ВариантИзСписка.Значение.Представление;
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанные(ИдентификаторОтчета, Отчет, ВариантОтчета, Настройки, НастройкиСтрокой, Фильтры, ФильтрыСтрокой)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторОтчета", ИдентификаторОтчета);
	ПараметрыОтбора.Вставить("Отчет", Отчет);
	ПараметрыОтбора.Вставить("ВариантОтчета", ВариантОтчета);
	СтрокиОтчета = Объект.Отчеты.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаСОтчетом ИЗ СтрокиОтчета Цикл
		СтрокаСОтчетом.Настройки = Настройки;
		СтрокаСОтчетом.НастройкиСтрокой = НастройкиСтрокой;
		
		СтрокаСОтчетом.Фильтры = Фильтры;
		СтрокаСОтчетом.ФильтрыСтрокой = ФильтрыСтрокой;
	КонецЦикла;
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НовыеНастройкиОтчетаКлиента" И Источник.КлючУникальности = ЭтаФорма.КлючУникальности Тогда
		УстановитьДанные(Параметр.ИдентификаторОтчета, Параметр.Отчет, Параметр.ВариантОтчета, Параметр.Настройки, Параметр.НастройкиСтрокой,  Параметр.Фильтры,  Параметр.ФильтрыСтрокой)
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппыОтчетовПриАктивизацииСтроки(Элемент)
	ТД = Элементы.ГруппыОтчетов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("ИдентификаторГруппы", Неопределено);
	Иначе
		ПараметрыОтбора = Новый ФиксированнаяСтруктура("ИдентификаторГруппы", ТД.ИдентификаторГруппы);
	КонецЕсли;
	Элементы.Отчеты.ОтборСтрок = ПараметрыОтбора;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТД = Элементы.ГруппыОтчетов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		ИдентификаторГруппы = Неопределено;
	Иначе
		ИдентификаторГруппы = ТД.ИдентификаторГруппы;
		
	КонецЕсли;

	Элемент.ТекущиеДанные.ИдентификаторГруппы = ИдентификаторГруппы;
	
	ТекущиеТД = Элемент.ТекущиеДанные;
	Если ТекущиеТД.ИдентификаторОтчета = "" Тогда 
		ТекущиеТД.ИдентификаторОтчета = Строка(Новый УникальныйИдентификатор()); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыОтчетовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если Элемент.ТекущиеДанные.ИдентификаторГруппы = "" Тогда
		Элемент.ТекущиеДанные.ИдентификаторГруппы = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТД = Элементы.ГруппыОтчетов.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Отказ = Истина;
		Сообщить("Требуется выбрать группу отчетов");
	КонецЕсли;
	
КонецПроцедуры




&НаКлиенте
Процедура ОтчетыВариантОтчетаПользовательскийПриИзменении(Элемент)
	
	ТД = Элементы.Отчеты.ТекущиеДанные;
	
	ВариантОтчетаПользовательский = ТД.ВариантОтчетаПользовательский;
	СтруктураВариантов = УправлениеБТВызовСервера.ИзJSON(ТД.ВариантОтчета);
	Для Каждого Вариант ИЗ СтруктураВариантов Цикл
		Если Вариант.Ключ = ВариантОтчетаПользовательский Тогда
			Вариант.Значение.Выбран = Истина;
			ТД.ВариантОтчетаПользовательский = Вариант.Значение.Представление;
		Иначе
			Вариант.Значение.Выбран = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыПриАктивизацииСтроки(Элемент)
	
	Элементы.ОтчетыВариантОтчетаПользовательский.СписокВыбора.Очистить();
	Индекс = -1;
	ТД = Элементы.Отчеты.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		Если ТД.ВариантОтчета <> "" Тогда
			СтруктураВариантов = УправлениеБТВызовСервера.ИзJSON(ТД.ВариантОтчета);
			Для Каждого Вариант ИЗ СтруктураВариантов Цикл
				Индекс = Индекс+1;
				Элементы.ОтчетыВариантОтчетаПользовательский.СписокВыбора.Вставить(Индекс, Вариант.Ключ, Вариант.Значение.Представление);
				Если Вариант.Значение.Выбран Тогда
					ТД.ВариантОтчетаПользовательский = Вариант.Значение.Представление;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЭкспертныйРежим(Команда)
	Элементы.Страницы.Видимость = НЕ Элементы.Страницы.Видимость;
КонецПроцедуры
